content/posts/2019-04-10-emacs-wsl.org
#+TITLE: Emacs and Windows Subsystem for Linux
#+DATE: [2019-04-10]
#+STARTUP: showall
#+OPTIONS: auto-id:t

While setting up Flyspell on Linux was a really straightforward process, I was
really struggling with spell checking on Windows. After giving up and trying
again several times, I have finally found a solution which is ok-ish using
aspell. There's a Windows port for aspell, but the last time I've checked the
latest release was several years old. So instead I'm running aspell using WSL.
My steps look like this:

- [[https://docs.microsoft.com/en-us/windows/wsl/install-win10][Install WSL and Ubuntu]]
- Open up cmd or Powershell and type:

#+begin_src cmd
Ubuntu1804 run sudo apt-get update
Ubuntu1804 run sudo apt-get install aspell -y
#+end_src

- Create a script ~aspell.cmd~ with the following content:

#+begin_src cmd
@echo off
Ubuntu1804 run %~n0 %*
#+end_src

- Put ~aspell.cmd~ on your ~$PATH~

We can now call aspell with whatever parameters we would like without the
"Ubuntu1804 run" prefix. This is for sure not the best solution, but I've
settled for now.
