posts/2019-04-10-emacs-wsl/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs and Windows Subsystem for Linux</title>
<meta name="generator" content="Org Mode" />
<meta name="author" content="Florian Winkelbauer">
<link rel="stylesheet" href="/site.css" type="text/css">
</head>
<body>
<div id="preamble" class="status">
<nav>
<a href="/">Home</a>
<a href="/notes">Notes</a>
<a href="/posts">Posts</a>
<a href="/projects">Projects</a>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Emacs and Windows Subsystem for Linux</h1>
</header><p>
While setting up Flyspell on Linux was a really straightforward process, I was
really struggling with spell checking on Windows. After giving up and trying
again several times, I have finally found a solution which is ok-ish using
aspell. There's a Windows port for aspell, but the last time I've checked the
latest release was several years old. So instead I'm running aspell using WSL.
My steps look like this:
</p>

<ul class="org-ul">
<li><a href="https://docs.microsoft.com/en-us/windows/wsl/install-win10">Install WSL and Ubuntu</a></li>
<li>Open up cmd or Powershell and type:</li>
</ul>

<div class="org-src-container">
<pre class="src src-cmd">Ubuntu1804 run sudo apt-get update
Ubuntu1804 run sudo apt-get install aspell -y
</pre>
</div>

<ul class="org-ul">
<li>Create a script <code>aspell.cmd</code> with the following content:</li>
</ul>

<div class="org-src-container">
<pre class="src src-cmd">@echo off
Ubuntu1804 run %~n0 %*
</pre>
</div>

<ul class="org-ul">
<li>Put <code>aspell.cmd</code> on your <code>$PATH</code></li>
</ul>

<p>
We can now call aspell with whatever parameters we would like without the
"Ubuntu1804 run" prefix. This is for sure not the best solution, but I've
settled for now.
</p>
</div>
<div id="postamble" class="status">
<p class="date">Published: 2019-04-10</p>
<footer>
<p>Copyright 2025, Florian Winkelbauer. All rights reserved.</p>
</footer>
</div>
</body>
</html>
